/* XMSG: Placeholder text in chart when there is no data */
"No Data" = "Tiada Data";

/* XBUT: Save action in inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Save" = "Simpan";

/* XBUT: Re-enter action available in saved state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Re-enter Signature" = "Masukkan Semula Tandatangan";

/* XBUT: Clear action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Clear" = "Kosongkan";

/* XBUT: Cancel action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Cancel" = "Batal";

/* XTIT: Title of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Signature" = "Tandatangan";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Tap to Sign" = "Ketik untuk Menandatangani";

/* XACT: The accessibility label for the signature area */
"Signature Area" = "Bahagian Tandatangan";

/* XACT: The accessibility hint for the signature area */
"Double tap and drag to sign" = "Ketik dua kali dan seret untuk tandatangan";

/* XACT: The accessibility label for the signature image */
"Signature Image" = "Imej Tandatangan";

/* XACT: The accessibility label for the signature line */
"Signature Line" = "Baris Tandatangan";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Canceled" = "Dibatalkan";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Next" = "Seterusnya";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Ok" = "Ok";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Status" = "Status";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"User canceled Onboarding" = "Pengguna membatalkan Onboarding";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Without consent you will not be able to continue onboarding." = "Anda tidak boleh meneruskan onboarding tanpa persetujuan.";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Give Consent" = "Beri Persetujuan";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Quit" = "Keluar";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Back" = "Kembali";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Step" = "Langkah";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"of" = "bagi";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Are you sure you want to quit the onboarding process?" = "Adakah anda pasti ingin keluar daripada proses onboarding?";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Want Data Privacy?" = "Inginkan Privasi Data?";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Be wise about your data" = "Berjaga-jaga dengan data anda";

/* XBUT: Not Now action title in UserConsentForm */
"Not Now" = "Bukan Sekarang";

/* XBUT: Allow action title in UserConsentForm */
"Allow" = "Benarkan";

/* XBUT: Deny action title in UserConsentForm */
"Deny" = "Tolak";

/* XBUT: Agree action title in EULAView */
"Agree" = "Setuju";

/* XBUT: Disagree action title in EULAView */
"Disagree" = "Tidak bersetuju";

/* XMSG: Placeholder text in DataTable for loading state */
"Loading..." = "Memuat...";

/* XMSG: Placeholder text in DataTable when there is no data */
"There is nothing to display yet" = "Tiada apa-apa untuk dipaparkan lagi";

/* XBUT: Default duration foramtter in DataTable */
"%d Hrs %d Min" = "%d Jam %d Minit";

/* XBUT: Done action in keyboard toolbar for a Textfield in DataTable */
"Done" = "Selesai";

/* XBUT: Error messages shown to users in DataTable */
"There are %d errors in the data table." = "Terdapat %d ralat dalam jadual data.";

/* XBUT: voice over label for row header in DataTable */
"row header" = "pengepala baris";

/* XBUT: voice over label for row %d in DataTable */
"row %d" = "baris %d";

/* XBUT: voice over label for column %d in DataTable */
"column %d" = "lajur %d";

/* XBUT: voice over label for cell type of `leading accessory` in DataTable */
"leading accessory" = "aksesori utama";

/* XBUT: voice over label for cell type of `trailing accessory` in DataTable */
"trailing accessory" = "aksesori mengekor";

/* XBUT: voice over label for cell type of `text` in DataTable */
"text" = "teks";

/* XBUT: voice over label for cell type of `image` in DataTable */
"image" = "imej";

/* XBUT: voice over label for cell type of `date` in DataTable */
"date" = "tarikh";

/* XBUT: voice over label for cell type of `time` in DataTable */
"time" = "masa";

/* XBUT: voice over label for cell type of `duration` in DataTable */
"duration" = "jangka masa";

/* XBUT: voice over label for cell type of `list item` in DataTable */
"list item" = "item senarai";

/* XBUT: voice over label for row selection status in DataTable */
"selected" = "dipilih";

/* XBUT: voice over label for row selection status in DataTable */
"not selected" = "tidak dipilih";

/* XBUT: calendar time component label */
"Time" = "Masa";

/* XBUT: slider default value label formatter for integer */
"Value: %d" = "Nilai: %d";

/* XMSG: a toast message for read-only cell in DataTable */
"Tapped cell is read-only." = "Sel yang diketik adalah baca sahaja.";

/* Default hint text for Read-only Field for NoteFormView and TextFieldFormView */
"Read-only field" = "Medan baca sahaja";

/* Default error text for when the character count reaches the maximum limit for NoteFormView and TextFieldFormView */
"No more characters remaining" = "Tiada baki aksara lagi";

/* Default error text for when the character count exceeds the maximum limit for NoteFormView and TextFieldFormView */
"Reduce the number of characters" = "Kurangkan bilangan aksara";

